#ifndef DECIMAL_HXX_
#define DECIMAL_HXX_
#include <type_traits>
namespace aries_acc {

// typedef unsigned char uint8_t;
// typedef int int32_t;

#ifdef LEN_fir
#define NUM_TOTAL_DIG 4
#endif
#ifdef LEN_sec
#define NUM_TOTAL_DIG 8
#endif
#ifdef LEN_thr
#define NUM_TOTAL_DIG 16
#endif
#ifdef LEN_for
#define NUM_TOTAL_DIG 32
#endif
#ifdef LEN_fiv
#define NUM_TOTAL_DIG 64
#endif
#ifdef LEN_six
#define NUM_TOTAL_DIG 128
#endif

#define ARIES_MODE_EMPTY 0  // 0b00
#define MAX_INT32 4294967296
#define MAX_NUM32 (0xFFFFFFFF)

#define ERR_OVER_FLOW 1
#define ERR_DIV_BY_ZERO 2

#define INDEX_LAST_DIG (NUM_TOTAL_DIG - 1)

// precision/scale精度的定义
#define DEFAULT_PRECISION 10  // 默认的precision精度
#define TINYINT_PRECISION 3
#define SMALLINT_PRECISION 5
#define MEDIUMINT_PRECISION 8
#define INT_PRECISION 10
#define BIGINT_PRECISION 19
#define INT128_PRECISION 39
#define DEFAULT_SCALE 0  // 默认的scale精度

#define PER_INT_MAX_BIT 32  // 每个uint32 的最大 bit 数量

#define MAX_BASE10_PER_INT 1000000000

#define PER_DEC_MAX_SCALE 4294967296  // 每个int的值不能大于此值
#define DIV_FIX_INNER_FRAC 6
#define DIV_FIX_EX_FRAC 4  // 计算除法时，正常结果只需要多保留4位小数

#define DIG_PER_INT32 9  // 每个int能够表示的十进制的位数: 9
#define GET_SIGN_FROM_BIT(x) ((x >> 7) & 0x1)  // 对compact decimal，获取符号位
#define SET_SIGN_BIT(x, sign) \
  (x = (x | sign << 7))  // 对compact
                         // decimal，将符号位设置到某一个byte的第一个bit上

#define ARIES_ALIGN(x) __attribute__((aligned(x)))
#define ARIES_PACKED __attribute__((packed))

#ifdef __CUDACC__

#ifndef ARIES_HOST_DEVICE
#define ARIES_HOST_DEVICE __forceinline__ __device__ __host__
#endif

#ifndef ARIES_HOST_DEVICE_NO_INLINE
#define ARIES_HOST_DEVICE_NO_INLINE __device__ __host__
#endif

#ifndef ARIES_DEVICE
#define ARIES_DEVICE __device__
#endif

#ifndef ARIES_LAMBDA
#define ARIES_LAMBDA __device__ __host__
#endif

#ifndef ARIES_DEVICE_FORCE
#define ARIES_DEVICE_FORCE __forceinline__ __device__
#endif

#else  // #ifndef __CUDACC__

#define ARIES_HOST_DEVICE
#define ARIES_HOST_DEVICE_NO_INLINE
#define ARIES_DEVICE
#define ARIES_LAMBDA

#endif  // #ifdef __CUDACC__

typedef unsigned char uint8_t;
typedef unsigned short int uint16_t;
typedef unsigned int uint32_t;
typedef unsigned long uint64_t;
static_assert(sizeof(uint8_t) == 1, "");
static_assert(sizeof(uint16_t) == 2, "");
static_assert(sizeof(uint32_t) == 4, "");
static_assert(sizeof(uint64_t) == 8, "");

typedef char int8_t;
typedef short int16_t;
typedef int int32_t;
typedef long int64_t;
static_assert(sizeof(int8_t) == 1, "");
static_assert(sizeof(int16_t) == 2, "");
static_assert(sizeof(int32_t) == 4, "");
static_assert(sizeof(int64_t) == 8, "");

struct ARIES_PACKED CompactDecimal {
  char data[1];
};

struct ARIES_PACKED Decimal {
  uint8_t sign;
  uint8_t prec;
  uint8_t frac;
  uint8_t error;
  uint32_t v[NUM_TOTAL_DIG];

 public:
  ARIES_HOST_DEVICE_NO_INLINE Decimal();
  ARIES_HOST_DEVICE_NO_INLINE Decimal(uint32_t precision, uint32_t scale);
  ARIES_HOST_DEVICE_NO_INLINE Decimal(uint32_t precision, uint32_t scale,
                                      uint32_t m);
  ARIES_HOST_DEVICE_NO_INLINE Decimal(uint32_t precision, uint32_t scale,
                                      const char s[]);
  ARIES_HOST_DEVICE_NO_INLINE Decimal(uint32_t precision, uint32_t scale,
                                      uint32_t m, const char s[]);
  ARIES_HOST_DEVICE_NO_INLINE Decimal(const CompactDecimal* compact,
                                      uint32_t precision, uint32_t scale,
                                      uint32_t m = ARIES_MODE_EMPTY);
